# LEET CODE
## Problem-1084: Sales Analysis III

Class: Easy

Source: https://leetcode.com/problems/sales-analysis-iii/

## Description
Table: Product
| Column Name  | Type    |
|--------------|---------|
| product_id   | int     |
| product_name | varchar |
| unit_price   | int     |

product_id is the primary key (column with unique values) of this table.

Each row of this table indicates the name and the price of each product.

Table: Sales
| Column Name | Type    |
|-------------|---------|
| seller_id   | int     |
| product_id  | int     |
| buyer_id    | int     |
| sale_date   | date    |
| quantity    | int     |
| price       | int     |

This table can have duplicate rows.

product_id is a foreign key (reference column) to the Product table.

Each row of this table contains some information about one sale.

## To Do
Write a solution to report the products that were only sold in the first quarter of 2019. That is, between 2019-01-01 and 2019-03-31 inclusive.

Return the result table in any order.

The result format is in the following example.

## Example

Input: 

Product table:
| product_id | product_name | unit_price |
|------------|--------------|------------|
| 1          | S8           | 1000       |
| 2          | G4           | 800        |
| 3          | iPhone       | 1400       |

Sales table:
| seller_id | product_id | buyer_id | sale_date  | quantity | price |
|-----------|------------|----------|------------|----------|-------|
| 1         | 1          | 1        | 2019-01-21 | 2        | 2000  |
| 1         | 2          | 2        | 2019-02-17 | 1        | 800   |
| 2         | 2          | 3        | 2019-06-02 | 1        | 800   |
| 3         | 3          | 4        | 2019-05-13 | 2        | 2800  |

Output: 
| product_id  | product_name |
|-------------|--------------|
| 1           | S8           |

- Explanation: 
- The product with id 1 was only sold in the spring of 2019.
- The product with id 2 was sold in the spring of 2019 but was also sold after the spring of 2019.
- The product with id 3 was sold after spring 2019.
- We return only product 1 as it is the product that was only sold in the spring of 2019.

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
data = [[1, 'S8', 1000], [2, 'G4', 800], [3, 'iPhone', 1400]]
Product = pd.DataFrame(data, columns=['product_id', 'product_name', 'unit_price']).astype({'product_id':'Int64', 'product_name':'object', 'unit_price':'Int64'})
data = [[1, 1, 1, '2019-01-21', 2, 2000], [1, 2, 2, '2019-02-17', 1, 800], [2, 2, 3, '2019-06-02', 1, 800], [3, 3, 4, '2019-05-13', 2, 2800]]
Sales = pd.DataFrame(data, columns=['seller_id', 'product_id', 'buyer_id', 'sale_date', 'quantity', 'price']).astype({'seller_id':'Int64', 'product_id':'Int64', 'buyer_id':'Int64', 'sale_date':'datetime64[ns]', 'quantity':'Int64', 'price':'Int64'})

In [3]:
Product

   product_id product_name  unit_price
0           1           S8        1000
1           2           G4         800
2           3       iPhone        1400

In [4]:
Sales

   seller_id  product_id  buyer_id  sale_date  quantity  price
0          1           1         1 2019-01-21         2   2000
1          1           2         2 2019-02-17         1    800
2          2           2         3 2019-06-02         1    800
3          3           3         4 2019-05-13         2   2800

## Task

In [7]:
# Define the SQL query
query = """
SELECT product_id, product_name
FROM Product
LEFT JOIN (
    SELECT  product_id, MIN(sale_date) AS start_date, MAX(sale_date) AS end_date 
    FROM Sales
    GROUP BY product_id
    ) AS product_date USING(product_id)
WHERE DATE(start_date) >= "2019-01-01"
AND DATE(end_date) <= "2019-03-31"
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Product':Product, 'Sales':Sales})

# Dipslay the results dataframe
display(result)

   product_id product_name
0           1           S8